Blynk-Technologies/Blynk-DT-nRF9151-NTN-Firmware/app/src/modules/ntn/ntn.c
			return err;
		}

		LOG_DBG("NTN initialized, using AT+CFUN=21");

		err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_LTE);
		if (err) {
			LOG_ERR("lte_lc_func_mode_set, error: %d", err);

			return err;
		}

		err = ntn_location_set((double)state->last_pvt.latitude,
				       (double)state->last_pvt.longitude,
				       (float)state->last_pvt.altitude,
				       location_validity_time);
		if (err) {
			LOG_ERR("Failed to set location, error: %d", err);

			return err;
		}
	} else {
		struct lte_lc_cellular_profile ntn_profile = {
			.id = 0,
			.act = LTE_LC_ACT_NTN,
			.uicc = LTE_LC_UICC_PHYSICAL,
		};

		struct lte_lc_cellular_profile tn_profile = {
			.id = 1,
			.act = LTE_LC_ACT_LTEM || LTE_LC_ACT_NBIOT,
			.uicc = LTE_LC_UICC_PHYSICAL,
		};

		/* Power off modem */
		err = lte_lc_power_off();
		if (err) {
			LOG_ERR("lte_lc_power_off, error: %d", err);

			return err;
		}

		/* Set NTN profile */
		err = lte_lc_cellular_profile_configure(&ntn_profile);
		if (err) {
			LOG_ERR("Failed to set NTN profile, error: %d", err);

			return err;
		}

		/* Set TN profile */
		err = lte_lc_cellular_profile_configure(&tn_profile);
		if (err) {
			LOG_ERR("Failed to set TN profile, error: %d", err);

			return err;
		}

		/* Configure NTN system mode */
		err = lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_NTN_NBIOT,
					     LTE_LC_SYSTEM_MODE_PREFER_AUTO);
		if (err) {
			LOG_ERR("Failed to set NTN system mode, error: %d", err);

			return err;
		}

		err = ntn_location_set((double)state->last_pvt.latitude,
				       (double)state->last_pvt.longitude,
				       (float)state->last_pvt.altitude,
				       location_validity_time);
		if (err) {
			LOG_ERR("Failed to set location, error: %d", err);

			return err;
		}

#if defined(CONFIG_APP_NTN_BANDLOCK_ENABLE)
		err = nrf_modem_at_printf("AT%%XBANDLOCK=2,,\"%i\"", CONFIG_APP_NTN_BANDLOCK);
		if (err) {
			LOG_ERR("Failed to set NTN band lock, error: %d", err);

			return err;
		}
#endif

#if defined(CONFIG_APP_NTN_CHANNEL_SELECT_ENABLE)
		err = nrf_modem_at_printf("AT%%CHSELECT=2,14,%i", CONFIG_APP_NTN_CHANNEL_SELECT);
		if (err) {
			LOG_ERR("Failed to set NTN channel, error: %d", err);

			return err;
		}
#endif

		err = lte_lc_psm_req(false);
		if (err) {
			LOG_ERR("Failed to deactivate legacy PSM, error: %d", err);

			return err;
		}

		state->ntn_initialized = true;

		k_sleep(K_MSEC(5000));

		LOG_DBG("NTN now initialized, using lte_lc_connect_async to connect to network");

		err = lte_lc_connect_async(lte_lc_evt_handler);
		if (err) {
			LOG_ERR("lte_lc_connect_async, error: %d\n", err);

			return err;
		}
	}

	return 0;
}

static int set_gnss_active_mode(struct ntn_state_object *state)
{
	int err;

	if (state->gnss_initialized) {
		/* Configure GNSS system mode */
		err = lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_GPS, LTE_LC_SYSTEM_MODE_PREFER_AUTO);
		if (err) {
			LOG_ERR("Failed to set GNSS system mode, error: %d", err);

			return err;
		}

		/* Activate GNSS fun mode */
		err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_GNSS);
		if (err) {
			LOG_ERR("Failed to activate GNSS fun mode, error: %d", err);

			return err;
		}
	} else {
		/* Power off modem */
		err = lte_lc_power_off();
		if (err) {
			LOG_ERR("lte_lc_power_off, error: %d", err);

			return err;
		}

		/* Configure GNSS system mode */
		err = lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_GPS, LTE_LC_SYSTEM_MODE_PREFER_AUTO);
		if (err) {
			LOG_ERR("Failed to set GNSS system mode, error: %d", err);

			return err;
		}

		/* Activate GNSS mode */
		err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_GNSS);
		if (err) {
			LOG_ERR("Failed to activate GNSS fun mode, error: %d", err);

			return err;
		}

		state->gnss_initialized=true;
	}

	err = nrf_modem_gnss_fix_interval_set(0);
	if (err) {
		LOG_ERR("Failed to set GNSS fix interval, error: %d", err);
	}

	err = nrf_modem_gnss_fix_retry_set(180);
	if (err) {
		LOG_ERR("Failed to set GNSS fix retry, error: %d", err);
	}

	err = nrf_modem_gnss_start();
	if (err) {
		LOG_ERR("Failed to start GNSS, error: %d", err);
	}

	return 0;
}

static int set_gnss_inactive_mode(void)
{
	int err;

	/* Set modem to CFUN=30 mode when exiting GNSS state */
	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_GNSS);
	if (err) {
		LOG_ERR("lte_lc_func_mode_set, error: %d", err);

		return err;
	}

	return 0;
}

/* Socket functions */
static int sock_open_and_connect(struct ntn_state_object *state)
{
	int err;
	struct sockaddr_storage host_addr;
	struct sockaddr_in *server4 = ((struct sockaddr_in *)&host_addr);

	server4->sin_family = AF_INET;
	server4->sin_port = htons(CONFIG_APP_NTN_SERVER_PORT);

	(void)inet_pton(AF_INET, CONFIG_APP_NTN_SERVER_ADDR, &server4->sin_addr);

	/* Create UDP socket */
	state->sock_fd = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
	if (state->sock_fd < 0) {
		LOG_ERR("Failed to create UDP socket, error: %d", errno);

		return -errno;
	}

	/* Connect socket */
	err = connect(state->sock_fd, (struct sockaddr *)&host_addr, sizeof(struct sockaddr_in));
	if (err < 0) {
		LOG_ERR("Failed to connect socket, error: %d", errno);
		close(state->sock_fd);

		state->sock_fd = -1;

		return -errno;
	}

	return 0;
}

static int sock_send_gnss_data(struct ntn_state_object *state)
{
	int err;
	char message[256];
	char imei[16] = {0};
	char imei_suffix[5];
	size_t imei_len;
	char temp[16] = {0};

	if (state->sock_fd < 0) {
		LOG_ERR("Socket not connected");

		return -ENOTCONN;
	}

	err = modem_info_string_get(MODEM_INFO_IMEI, imei, sizeof(imei));
	if (err < 0) {
		err = snprintk(imei, sizeof(imei), "N/A");
		if (err < 0 || err >= sizeof(imei)) {
			LOG_ERR("Failed to get IMEI, error: %d", err);

			return -EINVAL;
		}
	}

	/* Extract last 4 characters of IMEI safely */

	imei_len = strnlen(imei, sizeof(imei));
	if (imei_len > 4) {
		err = snprintk(imei_suffix, sizeof(imei_suffix), "%s", imei + (imei_len - 4));
		if (err < 0 || err >= sizeof(imei_suffix)) {
			LOG_ERR("Failed to get IMEI suffix, error: %d", err);

			return -EINVAL;
		}
	} else {
		err = snprintk(imei_suffix, sizeof(imei_suffix), "N/A");
		if (err < 0 || err >= sizeof(imei_suffix)) {
			LOG_ERR("Failed to get IMEI suffix, error: %d", err);

			return -EINVAL;
		}

		LOG_WRN("IMEI is too short, using N/A");
	}

