Blynk-Technologies/Blynk-DT-nRF9151-NTN-Firmware/app/src/modules/ntn/ntn.c
	imei_suffix[sizeof(imei_suffix) - 1] = '\0';

	/* Get the temperature from the modem */
	err = modem_info_string_get(MODEM_INFO_TEMP, temp, sizeof(temp));
	if (err < 0) {
		err = snprintk(temp, sizeof(temp), "N/A");
		if (err < 0 || err >= sizeof(temp)) {
			LOG_ERR("Failed to get temperature, error: %d", err);

			return -EINVAL;
		}
	}

	temp[sizeof(temp) - 1] = '\0';
	int64_t current_timestamp = 0;
	struct tm send_tm = {0};
	bool has_send_time = false;

#if defined(CONFIG_APP_NTN_SEND_GNSS_DATA)
	/* Use current system time (GNSS-synced by apply_gnss_time()) for send timestamp */
	if (date_time_now(&current_timestamp) == 0) {
		/* date_time_now returns ms since epoch in this project; convert to seconds */
		current_timestamp /= 1000;
		time_t current_time = (time_t)current_timestamp;
		struct tm *tm_ptr = gmtime(&current_time);

		if (tm_ptr != NULL) {
			send_tm = *tm_ptr;
			has_send_time = true;
		}
	}

	if (!has_send_time) {
		/* Fallback to PVT time if date_time() is not yet ready */
		send_tm.tm_year = state->last_pvt.datetime.year - 1900;
		send_tm.tm_mon = state->last_pvt.datetime.month - 1;
		send_tm.tm_mday = state->last_pvt.datetime.day;
		send_tm.tm_hour = state->last_pvt.datetime.hour;
		send_tm.tm_min = state->last_pvt.datetime.minute;
		send_tm.tm_sec = state->last_pvt.datetime.seconds;
	}

	/* Format GNSS data as string */
	err = snprintk(message, sizeof(message),
		"Device: *%s, temp: %s, lat=%.2f, lon=%.2f, alt=%.2f, "
		"time=%04d-%02d-%02d %02d:%02d:%02d",
		imei_suffix, temp,
		(double)state->last_pvt.latitude, (double)state->last_pvt.longitude, (double)state->last_pvt.altitude,
		send_tm.tm_year + 1900, send_tm.tm_mon + 1, send_tm.tm_mday,
		send_tm.tm_hour, send_tm.tm_min, send_tm.tm_sec);
	if (err < 0 || err >= sizeof(message)) {
		LOG_ERR("Failed to format GNSS data, error: %d", err);

		return -EINVAL;
	}
#else
	err = snprintk(message, sizeof(message),
		       "Device: *%s, temp: %s",
		       imei_suffix, temp);
	if (err < 0 || err >= sizeof(message)) {
		LOG_ERR("Failed to format GNSS data, error: %d", err);

		return -EINVAL;
	}
#endif

	/* Send data */
	err = send(state->sock_fd, message, strlen(message), 0);
	if (err < 0) {
		LOG_ERR("Failed to send GNSS data, error: %d", errno);
		return -errno;
	}

	LOG_DBG("Sent GNSS data payload of %d bytes: %s", strlen(message), message);

	return 0;
}

static void ntn_event_handler(const struct ntn_evt *evt)
{
	switch (evt->type) {
	case NTN_EVT_LOCATION_REQUEST:
		LOG_DBG("NTN location requested: %s, accuracy: %d m",
			evt->location_request.requested ? "true" : "false",
			evt->location_request.accuracy);

		ntn_msg_publish(NTN_LOCATION_REQUEST);

		break;
	default:
		break;
	}
}

/* State handlers */

static void state_running_entry(void *obj)
{
	int err;
	struct ntn_state_object *state = (struct ntn_state_object *)obj;

	LOG_INF("Initializing NTN module");

	k_work_init(&timer_work, timer_work_handler);
	k_work_init(&gnss_location_work, gnss_location_work_handler);
	k_timer_init(&state->ntn_timer, ntn_timer_handler, NULL);

	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Failed to initialize the modem library, error: %d", err);

		return;
	}

	/* Register GNSS event handler */
	nrf_modem_gnss_event_handler_set(gnss_event_handler);

	/* Register LTE event handler */
	lte_lc_register_handler(lte_lc_evt_handler);

	/* Register handler for default PDP context 0. */
	err = lte_lc_pdn_default_ctx_events_enable();
	if (err) {
		LOG_ERR("lte_lc_pdn_default_ctx_events_enable, error: %d", err);

		return;
	}

	ntn_register_handler(ntn_event_handler);

	k_timer_start(&state->ntn_timer, K_MINUTES(CONFIG_APP_NTN_TIMER_TIMEOUT_MINUTES), K_NO_WAIT);
}

static enum smf_state_result state_running_run(void *obj)
{
	struct ntn_state_object *state = (struct ntn_state_object *)obj;

	if (state->chan == &NTN_CHAN) {
		struct ntn_msg *msg = (struct ntn_msg *)state->msg_buf;

		if (msg->type == NTN_TIMEOUT) {
			/* Timer expired, restart timer and transition to GNSS mode */
			k_timer_start(&state->ntn_timer,
				      K_MINUTES(CONFIG_APP_NTN_TIMER_TIMEOUT_MINUTES),
				      K_NO_WAIT);
			smf_set_state(SMF_CTX(state), &states[STATE_NTN]);

			return SMF_EVENT_HANDLED;
		}

		if (msg->type == NTN_LOCATION_REQUEST) {
			uint64_t current_time = k_uptime_get();

			if (current_time < state->location_validity_end_time) {
				LOG_DBG("NTN location is still valid, skipping location request");

				return SMF_EVENT_HANDLED;
			}

			LOG_DBG("NTN location requested, location is invalid, going to GNSS mode");

			smf_set_state(SMF_CTX(state), &states[STATE_GNSS]);

			return SMF_EVENT_HANDLED;
		}
	} else if (state->chan == &BUTTON_CHAN) {
		k_timer_start(&state->ntn_timer,
			      K_MINUTES(CONFIG_APP_NTN_TIMER_TIMEOUT_MINUTES),
			      K_NO_WAIT);
		smf_set_state(SMF_CTX(state), &states[STATE_NTN]);

		return SMF_EVENT_HANDLED;
	}

	return SMF_EVENT_PROPAGATE;
}

static void state_gnss_entry(void *obj)
{
	int err;
	struct ntn_state_object *state = (struct ntn_state_object *)obj;

	/* Close socket if it was open */
	if (state->sock_fd >= 0) {
		close(state->sock_fd);

		state->sock_fd = -1;
		state->socket_connected = false;
	}

	LOG_INF("Entering GNSS mode");

	err = set_gnss_active_mode(state);
	if (err) {
		LOG_ERR("Unable to set GNSS mode");

		return;
	}
}

static enum smf_state_result state_gnss_run(void *obj)
{
	struct ntn_state_object *state = (struct ntn_state_object *)obj;

	if (state->chan == &NTN_CHAN) {
		struct ntn_msg *msg = (struct ntn_msg *)state->msg_buf;

		switch (msg->type) {
		case NTN_LOCATION_SEARCH_DONE:
			/* Location search completed, transition to NTN mode */
			memcpy(&state->last_pvt, &msg->pvt, sizeof(state->last_pvt));
			state->last_pvt_uptime = k_uptime_get();

			state->location_validity_end_time =
				k_uptime_get() +
				CONFIG_APP_NTN_LOCATION_VALIDITY_TIME_SECONDS * MSEC_PER_SEC;

			smf_set_state(SMF_CTX(state), &states[STATE_NTN]);

			return SMF_EVENT_HANDLED;

		case GNSS_SEARCH_FAILED:
			LOG_ERR("GNSS search failed, going to idle state");
			smf_set_state(SMF_CTX(state), &states[STATE_IDLE]);

